app/Controllers/Colaboradores.php

SELECT *
FROM `empresa`
WHERE `empresa`.`id` = '26'
---
    public function viewCadastro($id)
    {
        $empresaModel = new \App\Models\Empresa;
        $empresa = $empresaModel->find($id);