app/Controllers/Empresa.php

    public function editar($id)
    {
        $empresaModel = new \App\Models\Empresa;
        $empresa = $empresaModel->find($id);
---
SELECT *
FROM `empresa`
WHERE `empresa`.`id` = '48'