app/Models/Empresa.php

INSERT INTO `empresa` (`razaosocial`, `cnpj`, `fone`, `email`, `endereco`) VALUES ('bbaa', '87.799.168/0001-70', '222222', 'gustavo.pduatavares@gmail.com', '')
---
    public function cadastraEmpresa($dados)
    {
         $this->insert($dados);